Malumot bn tanishuv

In [1]:
import pandas as pd

ModuleNotFoundError: No module named 'pandas'

In [6]:
df=pd.read_csv('drug200.csv')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          200 non-null    int64
 1   Sex          200 non-null    object
 2   BP           200 non-null    object
 3   Cholesterol  200 non-null    object
 4   Na_to_K      200 non-null    float64
 5   Drug         200 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 9.5+ KB

In [11]:
df.isnull().sum()

Age            0
Sex            0
BP             0
Cholesterol    0
Na_to_K        0
Drug           0
dtype: int64

In [14]:
df=pd.read_csv('drug200.csv')

In [15]:
df.isnull().sum()

Age            0
Sex            0
BP             0
Cholesterol    1
Na_to_K        2
Drug           2
dtype: int64

In [17]:
df.isnull().any()

Age            False
Sex            False
BP             False
Cholesterol     True
Na_to_K         True
Drug            True
dtype: bool

In [18]:
df.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug
0   23   F    HIGH        HIGH   25.355  DrugY
1   47   M     LOW        HIGH   13.093  drugC
2   47   M     LOW        HIGH   10.114  drugC
3   28   F  NORMAL        HIGH    7.798  drugX
4   61   F     LOW        HIGH   18.043  DrugY

In [19]:
df.tail(5)

     Age Sex      BP Cholesterol  Na_to_K   Drug
190   56   F     LOW        HIGH   11.567  drugC
191   16   M     LOW        HIGH   12.006  drugC
192   52   M  NORMAL        HIGH    9.894  drugX
193   23   M  NORMAL      NORMAL   14.020  drugX
194   40   F     LOW      NORMAL   11.349  drugX

In [20]:
df.nunique()

Age             57
Sex              2
BP               3
Cholesterol      2
Na_to_K        191
Drug             5
dtype: int64

In [21]:
df.[Drug].nunique()

SyntaxError: invalid syntax (911125801.py, line 1)

In [25]:
df['Drug'].nunique()

5

In [26]:
df['Drug']

0      DrugY
1      drugC
2      drugC
3      drugX
4      DrugY
       ...
190    drugC
191    drugC
192    drugX
193    drugX
194    drugX
Name: Drug, Length: 195, dtype: object

In [29]:
df[['Drug', 'Na_to_K']]

      Drug  Na_to_K
0    DrugY   25.355
1    drugC   13.093
2    drugC   10.114
3    drugX    7.798
4    DrugY   18.043
..     ...      ...
190  drugC   11.567
191  drugC   12.006
192  drugX    9.894
193  drugX   14.020
194  drugX   11.349

[195 rows x 2 columns]

In [30]:
df.['Na_to_K'].nunique()

SyntaxError: invalid syntax (2094812575.py, line 1)

In [31]:
df['Na_to_K'].nunique()

191

In [32]:
df['Na_to_K']

0      25.355
1      13.093
2      10.114
3       7.798
4      18.043
        ...
190    11.567
191    12.006
192     9.894
193    14.020
194    11.349
Name: Na_to_K, Length: 195, dtype: float64